app/Controllers/IncidenciasController.php

SELECT *
FROM `incidencias`
---
    public function getAll()
    {
        $incidencias = new IncidenciasModel();
        $arrData = $incidencias->findAll();