app/Controllers/InventarioController.php

SELECT *
FROM `equipos`
---
    public function getAll()
    {
        $inventario = new EquiposModel();
        $arrData = $inventario->findAll();