app/Controllers/PrestamosController.php

SELECT *
FROM `prestamos`
---
    public function getAll()
    {
        $prestamos = new PrestamosModel();
        $arrData = $prestamos->findAll();